app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles"  ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "articles"
---
  def index
    @articles = Article.paginate(page: params[:page], per_page: 5)

INSERT INTO "articles" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "My name is Steve"], ["body", "Cap is here, what up?"], ["user_id", 1], ["created_at", "2016-06-21 15:35:03.692353"], ["updated_at", "2016-06-21 15:35:03.692353"]]
---
  def create
    @article = current_user.articles.build(article_params)

    respond_to do |format|
      if @article.save