app/controllers/comments_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 3]]
INSERT INTO "comments" ("body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "Yoo!!"], ["article_id", 3], ["created_at", "2016-06-25 09:07:28.559498"], ["updated_at", "2016-06-25 09:07:28.559498"]]
UPDATE "comments" SET "user_id" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["user_id", 1], ["updated_at", "2016-06-25 09:07:28.563645"], ["id", 1]]
---
  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create(params[:comment].permit(:body))
    @comment.user_id = current_user.id if current_user


    if @comment.save