app/controllers/pages_controller.rb

SELECT  "articles".* FROM "articles"  ORDER BY created_at DESC LIMIT 5 OFFSET 0
---
  def index
    if current_user
      redirect_to articles_path
    end
    @articles = Article.paginate(page: params[:page], per_page: 5).order("created_at DESC")